BlackAnt2015/BlackAnt_Robort_v3.0/kernel/inc/cpu/tcl.gd32.f450ve.h
/*************************************************************************************************
 *                                     Trochili RTOS Kernel                                      *
 *                                  Copyright(C) 2017 LIUXUMING                                  *
 *                                       www.trochili.com                                        *
 *************************************************************************************************/
#ifndef _TCL_GD32_F450VE_H
#define _TCL_GD32_F450VE_H

/* External Interrupts */
#define GD32F450VE_WWDGT_IRQn                  (0)
#define GD32F450VE_LVD_IRQn                    (1)
#define GD32F450VE_TAMPER_STAMP_IRQn           (2)
#define GD32F450VE_RTC_WKUP_IRQn               (3)
#define GD32F450VE_FMC_IRQn                    (4)
#define GD32F450VE_RCU_CTC_IRQn                (5)
#define GD32F450VE_EXTI0_IRQn                  (6)
#define GD32F450VE_EXTI1_IRQn                  (7)
#define GD32F450VE_EXTI2_IRQn                  (8)
#define GD32F450VE_EXTI3_IRQn                  (9)
#define GD32F450VE_EXTI4_IRQn                  (10)
#define GD32F450VE_DMA0_Channel0_IRQn          (11)
#define GD32F450VE_DMA0_Channel1_IRQn          (12)
#define GD32F450VE_DMA0_Channel2_IRQn          (13)
#define GD32F450VE_DMA0_Channel3_IRQn          (14)
#define GD32F450VE_DMA0_Channel4_IRQn          (15)
#define GD32F450VE_DMA0_Channel5_IRQn          (16)
#define GD32F450VE_DMA0_Channel6_IRQn          (17)
#define GD32F450VE_ADC_IRQn                    (18)
#define GD32F450VE_CAN0_TX_IRQn                (19)
#define GD32F450VE_CAN0_RX0_IRQn               (20)
#define GD32F450VE_CAN0_RX1_IRQn               (21)
#define GD32F450VE_CAN0_EWMC_IRQn              (22)
#define GD32F450VE_EXTI5_9_IRQn                (23)
#define GD32F450VE_TIMER0_BRK_TIMER8_IRQn      (24)
#define GD32F450VE_TIMER0_UP_TIMER9_IRQn       (25)
#define GD32F450VE_TIMER0_TRG_CMT_TIMER10_IRQn (26)
#define GD32F450VE_TIMER0_CC_IRQn              (27)
#define GD32F450VE_TIMER1_IRQn                 (28)
#define GD32F450VE_TIMER2_IRQn                 (29)
#define GD32F450VE_TIMER3_IRQn                 (30)
#define GD32F450VE_I2C0_EV_IRQn                (31)
#define GD32F450VE_I2C0_ER_IRQn                (32)
#define GD32F450VE_I2C1_EV_IRQn                (33)
#define GD32F450VE_I2C1_ER_IRQn                (34)
#define GD32F450VE_SPI0_IRQn                   (35)
#define GD32F450VE_SPI1_IRQn                   (36)
#define GD32F450VE_USART0_IRQn                 (37)
#define GD32F450VE_USART1_IRQn                 (38)
#define GD32F450VE_USART2_IRQn                 (39)
#define GD32F450VE_EXTI10_15_IRQn              (40)
#define GD32F450VE_RTC_Alarm_IRQn              (41)
#define GD32F450VE_USBFS_WKUP_IRQn             (42)
#define GD32F450VE_TIMER7_BRK_TIMER11_IRQn     (43)
#define GD32F450VE_TIMER7_UP_TIMER12_IRQn      (44)
#define GD32F450VE_TIMER7_TRG_CMT_TIMER13_IRQn (45)
#define GD32F450VE_TIMER7_CC_IRQn              (46)
#define GD32F450VE_DMA0_Channel7_IRQn          (47)
#define GD32F450VE_EXMC_IRQn                   (48)
#define GD32F450VE_SDIO_IRQn                   (49)
#define GD32F450VE_TIMER4_IRQn                 (50)
#define GD32F450VE_SPI2_IRQn                   (51)
#define GD32F450VE_UART3_IRQn                  (52)
#define GD32F450VE_UART4_IRQn                  (53)
#define GD32F450VE_TIMER5_DAC_IRQn             (54)
#define GD32F450VE_TIMER6_IRQn                 (55)
#define GD32F450VE_DMA1_Channel0_IRQn          (56)
#define GD32F450VE_DMA1_Channel1_IRQn          (57)
#define GD32F450VE_DMA1_Channel2_IRQn          (58)
#define GD32F450VE_DMA1_Channel3_IRQn          (59)
#define GD32F450VE_DMA1_Channel4_IRQn          (60)
#define GD32F450VE_ENET_IRQn                   (61)
#define GD32F450VE_ENET_WKUP_IRQn              (62)
#define GD32F450VE_CAN1_TX_IRQn                (63)
#define GD32F450VE_CAN1_RX0_IRQn               (64)
#define GD32F450VE_CAN1_RX1_IRQn               (65)
#define GD32F450VE_CAN1_EWMC_IRQn              (66)
#define GD32F450VE_USBFS_IRQn                  (67)
#define GD32F450VE_DMA1_Channel5_IRQn          (68)
#define GD32F450VE_DMA1_Channel6_IRQn          (69)
#define GD32F450VE_DMA1_Channel7_IRQn          (70)
#define GD32F450VE_USART5_IRQn                 (71)
#define GD32F450VE_I2C2_EV_IRQn                (72)
#define GD32F450VE_I2C2_ER_IRQn                (73)
#define GD32F450VE_USBHS_EP1_Out_IRQn          (74)
#define GD32F450VE_USBHS_EP1_In_IRQn           (75)
#define GD32F450VE_USBHS_WKUP_IRQn             (76)
#define GD32F450VE_USBHS_IRQn                  (77)
#define GD32F450VE_DCI_IRQn                    (78)
#define GD32F450VE_TRNG_IRQn                   (79)
#define GD32F450VE_FPU_IRQn                    (80)
#define GD32F450VE_UART6_IRQn                  (81)
#define GD32F450VE_UART7_IRQn                  (82)
#define GD32F450VE_SPI3_IRQn                   (83)
#define GD32F450VE_SPI4_IRQn                   (84)
#define GD32F450VE_SPI5_IRQn                   (85)
#define GD32F450VE_TLI_IRQn                    (86)
#define GD32F450VE_TLI_ER_IRQn                 (87)
#define GD32F450VE_IPA_IRQn                    (88)


extern void EXTI4_15_IRQnHandler(void);
extern void USART2_IRQnHandler(void);
#endif
